# -*- coding: utf-8 -*-
no_token_warning = 'Для запуска бота нужно обязательно указать токен\n' \
             'Пример:\n' \
             'python3 main.py -t 1233424243:GfvdhvT2DgVtnwzefgugGUgjjElFR4Ukbu'
channel_warning = 'Для постинга в каналы необходимо указать канал и user id администратора\n' \
				  'через ключи -c и -a соответственно'

socks5_help = 'SOCKS5 proxy for Telegram'
token_help = 'token'
channel_help = 'Канал для репостов'
admin_help = 'user id админа'
logs_help = 'Включить логи'

start = 'Напиши что-нибудь умное.'
error = 'Ошибка'

log_warning = 'Учти, что ведутся логи'
log_id = 'ID: '
log_username = 'Name: '
log_text_in = 'in: '
log_text_out = 'out: '

keyboard_random = 'Рандом'

btn_good = 'Репост в канал'
btn_bad = 'Ну такое'

post_req = '\n\n📣 Отправлен запрос на репост в канал'
post_adm = '\n📣'

admin_req_hdr = '⚠️ Запрос репоста\n\n'
